In [43]:
import sqlite3 
import psycopg2
import pandas as pd



dbname= 'ucykrkjj'
user = 'ucykrkjj'
password = 'qub1iGp24Aci4scgOyy7KUaYe6XVocke'
host = 'raja.db.elephantsql.com'

In [44]:
#establishing a connection and creating cursory object psycopg2
pg_conn = psycopg2.connect(dbname=dbname, user=user,
                           password=password, host=host)
pg_curs = pg_conn.cursor()

In [63]:
df = pd.read_csv('repos/tomfox1/SQL/module2-sql-for-analysis/titanic.csv')
df[df['Name'].str.contains('\'')]

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
28,1,3,Miss. Ellen O'Dwyer,female,24.0,0,0,7.8792
46,1,3,Miss. Bridget O'Driscoll,female,27.0,0,0,7.7500
185,1,3,Mrs. Thomas (Johanna Godfrey) O'Brien,female,26.0,1,0,15.5000
362,0,3,Mr. Thomas O'Brien,male,27.0,1,0,15.5000
456,0,3,Mr. Maurice O'Connor,male,17.0,0,0,7.7500
499,0,3,Miss. Bridget Mary O'Sullivan,female,21.0,0,0,7.6292
549,0,3,Mr. Timothy O'Brien,male,21.0,0,0,7.8292
626,0,3,Mr. Patrick D O'Connell,male,18.0,0,0,7.7333
650,1,3,Miss. Hanora O'Leary,female,16.0,0,0,7.8292

In [64]:
df['Name']=df['Name'].str.replace('\'','')
df[df['Name'].str.contains('\'')]

Empty DataFrame
Columns: [Survived, Pclass, Name, Sex, Age, Siblings/Spouses Aboard, Parents/Children Aboard, Fare]
Index: []

In [73]:
#I was having problems with SQL, since the code would not run since some passengers had double quotes 

#Dakota's way by converting directly to list:

#df = pd.read_csv('repos/tomfox1/SQL/module2-sql-for-analysis/titanic.csv')
#df["Name"] = titanic["Name"].replace("'", '', regex=True)
#df = titanic.values.tolist()

In [65]:
#using sqlalchemy to create our cursory object (engine)
from sqlalchemy import create_engine
engine = create_engine('sqlite://', echo=False)

In [66]:
df.to_sql(name='titanic', con=engine)

In [67]:
#engine here is equivalent to our cursory object when using sqlite3
passengers = engine.execute('SELECT * FROM titanic').fetchall()

In [68]:
create_tit = """
CREATE TABLE tit (
        passenger_id SERIAL PRIMARY KEY,
        Survived INT,
        Pclass INT,
        Name VARCHAR(100) NOT NULL, 
        Sex VARCHAR(50) NOT NULL,
        Age INT, 
        Sibling_spouse INT, 
        Parents_children INT,
        Fare MONEY
);
"""

In [69]:
#creatng our titanic table onto elephantSQL
pg_curs.execute(create_tit)

In [70]:
#victory, checking by running our browser on ElephantSQL
for passenger in passengers:
    insert_passenger = """
        INSERT INTO tit
        VALUES""" + str(passenger)
    pg_curs.execute(insert_passenger)
pg_conn.commit()